In [ ]:
# mysql -u root -p

Create Mysql database, tables and Insert the Information

In [ ]:
create database myntra_data;
use myntra_data;

In [ ]:
show tables;

In [ ]:
CREATE TABLE orders (
    id INT AUTO_INCREMENT PRIMARY KEY,
    user_id INT,
    product_id VARCHAR(10),
    price DECIMAL(10, 2) NOT NULL,
    created_at TIMESTAMP DEFAULT CURRENT_TIMESTAMP,
    FOREIGN KEY (user_id) REFERENCES users(id),
    FOREIGN KEY (product_id) REFERENCES products(id)
);

INSERT INTO orders (user_id, product_id, price) VALUES (1, 'PROD123', 999.00);

In [ ]:
CREATE TABLE products (
    id VARCHAR(10) PRIMARY KEY,
    name VARCHAR(255) NOT NULL,
    base_price DECIMAL(10, 2) NOT NULL,
    min_price DECIMAL(10, 2) NOT NULL,
    quantity INT NOT NULL
);

In [ ]:
> INSERT INTO products (id, name, base_price, min_price, quantity) VALUES
    -> ('001', 'Nikon COOLPIX A300 Point & Shoot Camera 20.1 MP', 606,600, 1400),
    -> ('002', 'Blue Heaven Festive Fair Tone Make Up Kit - Vanilla (10Pcs)', 1507,1457, 24),
    -> ('003', 'Calcuttacycleco Hero Cycles For Mens And Boys 27.5 T Mountain/Hardtail Cycle', 495,400, 249),
    -> ('004', 'macbook m1', 89999, 69999, 10),
    -> ('005', 'Pure Cotton T-shirt',  489,399, 3200),
    -> ('006', 'Men ReactX watch', 14995, 14995, 0),
    -> ('007', 'Men Slim Fit Regular Shorts',  639, 600, 388),
    -> ('008', 'Men Fresh Deodrant 150ml', 142, 120, 5200);

In [ ]:
> CREATE TABLE users (
    ->     id INT AUTO_INCREMENT PRIMARY KEY,
    ->     username VARCHAR(255) NOT NULL,
    ->     email VARCHAR(255) NOT NULL UNIQUE,
    ->     password_hash VARCHAR(255) NOT NULL,
    ->     SoTD_count INT DEFAULT 0,
    ->     total_purchase_count INT DEFAULT 0,
    ->     total_credit_points INT DEFAULT 0,
    ->     created_at TIMESTAMP DEFAULT CURRENT_TIMESTAMP,
    ->     updated_at TIMESTAMP DEFAULT CURRENT_TIMESTAMP ON UPDATE CURRENT_TIMESTAMP
    -> );

In [ ]:
> INSERT INTO users (username, email, password_hash, SoTD_count, total_purchase_count, total_credit_points)
    -> VALUES
    -> ('john_doe', 'john@example.com', '$2b$10$0h1lJ7Y/r8w/wH1JmXJG6Ou8Q6TfTTpjx4YG1l8ff4O8YhYb9G9Ii', 1, 5, 100),
    -> ('jane_smith', 'jane@example.com', '$2b$10$0h1lJ7Y/r8w/wH1JmXJG6Ou8Q6TfTTpjx4YG1l8ff4O8YhYb9G9Ii', 20, 11, 200),
    -> ('alice_jones', 'alice@example.com', '$2b$10$0h1lJ7Y/r8w/wH1JmXJG6Ou8Q6TfTTpjx4YG1l8ff4O8YhYb9G9Ii', 3, 25, 300),
    -> ('bob_brown', 'bob@example.com', '$2b$10$0h1lJ7Y/r8w/wH1JmXJG6Ou8Q6TfTTpjx4YG1l8ff4O8YhYb9G9Ii', 11, 15, 400);

Output from the Api

In [ ]:
mysql> show tables;
+-----------------------+
| Tables_in_myntra_data |
+-----------------------+
| arm_rewards           |
| orders                |
| products              |
| users                 |
+-----------------------+
4 rows in set (0.01 sec)

In [ ]:
mysql> select * from orders;
+----+---------+------------+----------+---------------------+
| id | user_id | product_id | price    | created_at          |
+----+---------+------------+----------+---------------------+
|  2 | 1       | PROD123    |   999.00 | 2024-07-14 03:40:13 |
|  3 | 1       | PROD123    |   999.00 | 2024-07-14 03:55:46 |
|  4 | 3       | 004        | 89999.00 | 2024-07-14 14:33:13 |
|  5 | 3       | 004        | 89999.00 | 2024-07-15 00:22:12 |
|  6 | 3       | 004        | 89999.00 | 2024-07-15 10:58:10 |
|  7 | 3       | 004        | 89999.00 | 2024-07-15 11:12:17 |
|  8 | 3       | 004        | 89699.00 | 2024-07-15 11:16:33 |
|  9 | 3       | 004        | 75999.00 | 2024-07-15 11:19:48 |
| 10 | 2       | 007        |   635.10 | 2024-07-15 11:23:09 |
| 11 | 2       | 001        |   600.00 | 2024-07-15 11:24:48 |
| 12 | 3       | 004        | 89200.00 | 2024-07-15 16:51:42 |
| 13 | 3       | 004        | 89000.00 | 2024-07-15 18:26:56 |
| 14 | 3       | 004        | 78890.00 | 2024-07-15 20:49:03 |
+----+---------+------------+----------+---------------------+
13 rows in set (0.02 sec)

In [ ]:
mysql> select * from products;
+---------+------------------------------------------------------------------------------+------------+-----------+----------+
| id      | name                                                                         | base_price | min_price | quantity |
+---------+------------------------------------------------------------------------------+------------+-----------+----------+
| 001     | Nikon COOLPIX A300 Point & Shoot Camera 20.1 MP                              |     606.00 |    600.00 |     1399 |
| 002     | Blue Heaven Festive Fair Tone Make Up Kit - Vanilla (10Pcs)                  |    1507.00 |   1457.00 |       24 |
| 003     | Calcuttacycleco Hero Cycles For Mens And Boys 27.5 T Mountain/Hardtail Cycle |     495.00 |    400.00 |      249 |
| 004     | macbook m1                                                                   |   89999.00 |  69999.00 |        1 |
| 005     | Pure Cotton T-shirt                                                          |     489.00 |    399.00 |     3200 |
| 006     | Men ReactX watch                                                             |   14995.00 |  14995.00 |        0 |
| 007     | Men Slim Fit Regular Shorts                                                  |     639.00 |    600.00 |      387 |
| 008     | Men Fresh Deodrant 150ml                                                     |     142.00 |    120.00 |     5200 |
| PROD123 | Sample Product                                                               |     999.00 |    799.00 |       98 |
| PROD133 |  duct tape                                                                   |    2999.00 |   1199.00 |       10 |
+---------+------------------------------------------------------------------------------+------------+-----------+----------+
10 rows in set (0.00 sec)

In [ ]:
mysql> mysql> select * from users;
+----+-------------+-------------------+--------------------------------------------------------------+------------+----------------------+---------------------+---------------------+---------------------+
| id | username    | email             | password_hash                                                | SoTD_count | total_purchase_count | total_credit_points | created_at          | updated_at          |
+----+-------------+-------------------+--------------------------------------------------------------+------------+----------------------+---------------------+---------------------+---------------------+
|  1 | john_doe    | john@example.com  | $2b$10$0h1lJ7Y/r8w/wH1JmXJG6Ou8Q6TfTTpjx4YG1l8ff4O8YhYb9G9Ii |         19 |                    5 |                 136 | 2024-07-14 03:51:42 | 2024-07-15 21:58:25 |
|  2 | jane_smith  | jane@example.com  | $2b$10$0h1lJ7Y/r8w/wH1JmXJG6Ou8Q6TfTTpjx4YG1l8ff4O8YhYb9G9Ii |         20 |                   11 |                 200 | 2024-07-14 03:51:42 | 2024-07-14 03:51:42 |
|  3 | alice_jones | alice@example.com | $2b$10$0h1lJ7Y/r8w/wH1JmXJG6Ou8Q6TfTTpjx4YG1l8ff4O8YhYb9G9Ii |          3 |                   25 |                 300 | 2024-07-14 03:51:42 | 2024-07-14 03:51:42 |
|  4 | bob_brown   | bob@example.com   | $2b$10$0h1lJ7Y/r8w/wH1JmXJG6Ou8Q6TfTTpjx4YG1l8ff4O8YhYb9G9Ii |         11 |                   15 |                 400 | 2024-07-14 03:51:42 | 2024-07-14 03:51:42 |
+----+-------------+-------------------+--------------------------------------------------------------+------------+----------------------+---------------------+---------------------+---------------------+
4 rows in set (0.01 sec)